In [10]:
import pandas as pd

In [11]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'],
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [12]:
x = df['ID']  #display in 1D
x

0    1
1    2
2    3
3    4
Name: ID, dtype: int64

In [13]:
type(x)

pandas.core.series.Series

In [14]:
x = df[['ID']]  #display in 2D
x

   ID
0   1
1   2
2   3
3   4

In [15]:
type(x)

pandas.core.frame.DataFrame

In [16]:
df.iloc[0, 0] #index based

'Rose'

In [18]:
df.loc[0, 'Salary'] #location based

100000

In [20]:
df2=df
df2=df2.set_index("Name")

df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

- loc[row_label, column_label]
- iloc[row_index, column_index]

In [21]:
df2.loc['Jane', 'Department']

'Design Team'

In [22]:
df2.iloc[3,2]

60000

#Test

In [24]:
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [27]:
df.iloc[0:2, 0:3] #row: 0-1, column: 0-2

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [28]:
df.loc[0:2,'ID':'Department'] #row: 0,1,2, column: ID, Dep

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team